In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("oscar_age_female.csv")

In [4]:
df[df["Age"] == 42]

,Index,Year,Age,Name,Movie,Movie_2
47,48,1975,42,"""Ellen Burstyn""","""Alice Doesn't Live Here Anymore""\t",NaN
63,64,1991,42,"""Kathy Bates""","""Misery""",NaN

In [5]:
df.head()

,Index,Year,Age,Name,Movie,Movie_2
0,1,1928,22,"""Janet Gaynor""","""Seventh Heaven","Street Angel and Sunrise: A Song of Two Humans"""
1,2,1929,37,"""Mary Pickford""","""Coquette""",NaN
2,3,1930,28,"""Norma Shearer""","""The Divorcee""\t",NaN
3,4,1931,63,"""Marie Dressler""","""Min and Bill""",NaN
4,5,1932,32,"""Helen Hayes""","""The Sin of Madelon Claudet""\t",NaN

In [6]:
df.tail()

    Index  Year  Age                  Name                       Movie Movie_2
84     85  2012   62        "Meryl Streep"             "The Iron Lady"     NaN
85     86  2013   22   "Jennifer Lawrence"   "Silver Linings Playbook"     NaN
86     87  2014   44      "Cate Blanchett"              "Blue Jasmine"     NaN
87     88  2015   54      "Julianne Moore"               "Still Alice"     NaN
88     89  2016   26         "Brie Larson"                      "Room"     NaN

In [7]:
df["Age"]

0     22
1     37
2     28
3     63
4     32
      ..
84    62
85    22
86    44
87    54
88    26
Name: Age, Length: 89, dtype: int64

In [8]:
df["Name"]

0           "Janet Gaynor"
1          "Mary Pickford"
2          "Norma Shearer"
3         "Marie Dressler"
4            "Helen Hayes"
              ...
84          "Meryl Streep"
85     "Jennifer Lawrence"
86        "Cate Blanchett"
87        "Julianne Moore"
88           "Brie Larson"
Name: Name, Length: 89, dtype: object

In [9]:
df["Movie"]

0                     "Seventh Heaven
1                          "Coquette"
2                    "The Divorcee"\t
3                      "Min and Bill"
4      "The Sin of Madelon Claudet"\t
                   ...
84                    "The Iron Lady"
85          "Silver Linings Playbook"
86                     "Blue Jasmine"
87                      "Still Alice"
88                             "Room"
Name: Movie, Length: 89, dtype: object

In [24]:
single = df[df["Name"].str.strip() == '"Janet Gaynor"']

In [25]:
single

,Index,Year,Age,Name,Movie,Movie_2
0,1,1928,22,"""Janet Gaynor""","""Seventh Heaven","Street Angel and Sunrise: A Song of Two Humans"""

In [26]:
single["Name".replace('"', "")]

0     "Janet Gaynor"
Name: Name, dtype: object

In [27]:
df

,Index,Year,Age,Name,Movie,Movie_2
0,1,1928,22,"""Janet Gaynor""","""Seventh Heaven","Street Angel and Sunrise: A Song of Two Humans"""
1,2,1929,37,"""Mary Pickford""","""Coquette""",NaN
2,3,1930,28,"""Norma Shearer""","""The Divorcee""\t",NaN
3,4,1931,63,"""Marie Dressler""","""Min and Bill""",NaN
4,5,1932,32,"""Helen Hayes""","""The Sin of Madelon Claudet""\t",NaN
...,...,...,...,...,...,...
84,85,2012,62,"""Meryl Streep""","""The Iron Lady""",NaN
85,86,2013,22,"""Jennifer Lawrence""","""Silver Linings Playbook""",NaN
86,87,2014,44,"""Cate Blanchett""","""Blue Jasmine""",NaN
87,88,2015,54,"""Julianne Moore""","""Still Alice""",NaN
88,89,2016,26,"""Brie Larson""","""Room""",NaN

In [28]:
df.describe()

           Index         Year        Age
count  89.000000    89.000000  89.000000
mean   45.000000  1972.000000  36.123596
std    25.836021    25.836021  11.745231
min     1.000000  1928.000000  21.000000
25%    23.000000  1950.000000  28.000000
50%    45.000000  1972.000000  33.000000
75%    67.000000  1994.000000  41.000000
max    89.000000  2016.000000  80.000000

In [37]:
df[df["Year"] == 1972]

    Index  Year  Age           Name     Movie Movie_2
44     45  1972   34   "Jane Fonda"   "Klute"     NaN

In [40]:
df.sort_values("Age", ascending=False).head(10)

,Index,Year,Age,Name,Movie,Movie_2
62,63,1990,80,"""Jessica Tandy""","""Driving Miss Daisy""",NaN
54,55,1982,74,"""Katharine Hepburn""","""On Golden Pond""",NaN
3,4,1931,63,"""Marie Dressler""","""Min and Bill""",NaN
84,85,2012,62,"""Meryl Streep""","""The Iron Lady""",NaN
40,41,1968,61,"""Katharine Hepburn""","""The Lion in Winter""",NaN
79,80,2007,61,"""Helen Mirren""","""The Queen""",NaN
58,59,1986,61,"""Geraldine Page""","""The Trip to Bountiful""\t",NaN
39,40,1967,60,"""Katharine Hepburn""","""Guess Who's Coming to Dinner""",NaN
87,88,2015,54,"""Julianne Moore""","""Still Alice""",NaN
24,25,1952,54,"""Shirley Booth""","""Come Back","Little Sheba"""

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89 entries, 0 to 88
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Index    89 non-null     int64
 1   Year     89 non-null     int64
 2   Age      89 non-null     int64
 3   Name     89 non-null     object
 4   Movie    89 non-null     object
 5   Movie_2  2 non-null      object
dtypes: int64(3), object(3)
memory usage: 4.3+ KB

In [49]:
isinstance(df, pd.DataFrame)

True

In [91]:
df[["Name", "Movie"]]

                    Name                            Movie
0         "Janet Gaynor"                  "Seventh Heaven
1        "Mary Pickford"                       "Coquette"
2        "Norma Shearer"                 "The Divorcee"\t
3       "Marie Dressler"                   "Min and Bill"
4          "Helen Hayes"   "The Sin of Madelon Claudet"\t
..                   ...                              ...
84        "Meryl Streep"                  "The Iron Lady"
85   "Jennifer Lawrence"        "Silver Linings Playbook"
86      "Cate Blanchett"                   "Blue Jasmine"
87      "Julianne Moore"                    "Still Alice"
88         "Brie Larson"                           "Room"

[89 rows x 2 columns]

In [118]:
df["Name"] = df["Name"].str.replace('"', "").str.strip()

In [122]:
df["Movie"] = df["Movie"].str.replace('"', "").str.strip()

In [123]:
df[df["Name"] == "Janet Gaynor"]

,Index,Year,Age,Name,Movie,Movie_2
0,1,1928,22,Janet Gaynor,Seventh Heaven,"Street Angel and Sunrise: A Song of Two Humans"""

In [124]:
df[df["Movie"] == "Room"]

    Index  Year  Age         Name Movie Movie_2
88     89  2016   26  Brie Larson  Room     NaN

In [125]:
df2 = pd.read_csv("oscar_age_female.csv", skipinitialspace=True)

In [128]:
df2[df2["Name"] == "Janet Gaynor"]

,Index,Year,Age,Name,Movie,Movie_2
0,1,1928,22,Janet Gaynor,"Seventh Heaven, Street Angel and Sunrise: A So...",NaN

In [129]:
df3 = pd.read_csv("oscar_age_female.csv")

In [131]:
df2.head(10)

,Index,Year,Age,Name,Movie,Movie_2
0,1,1928,22,Janet Gaynor,"Seventh Heaven, Street Angel and Sunrise: A So...",NaN
1,2,1929,37,Mary Pickford,Coquette,NaN
2,3,1930,28,Norma Shearer,The Divorcee\t,NaN
3,4,1931,63,Marie Dressler,Min and Bill,NaN
4,5,1932,32,Helen Hayes,The Sin of Madelon Claudet\t,NaN
5,6,1933,26,Katharine Hepburn,Morning Glory,NaN
6,7,1934,31,Claudette Colbert,It Happened One Night,NaN
7,8,1935,27,Bette Davis,Dangerous,NaN
8,9,1936,27,Luise Rainer,The Great Ziegfeld,NaN
9,10,1937,28,Luise Rainer,The Good Earth,NaN

In [132]:
df2[df2["Movie"] == "Room"]

    Index  Year  Age         Name Movie  Movie_2
88     89  2016   26  Brie Larson  Room      NaN